#       Вариант № 15.


#       № 17
#  (№ 7429)
#  Перед выполнением данного задания необходимо скачать файл с оффициального сайта Полякова
# f = open('17-402.txt')
# s = [int(x) for x in f]
# # print(s)   #  Проверка на корректный поток чисел из файла 17.txt
# k = 0
# w = []
# m = []
# for i in range(len(s)):
#     if 9 < s[i] < 100 and s[i] % (s[i] // 10 + s[i] % 10) == 0:
#         m.append(s[i])
# mn = min(m)
# for i in range(len(s) - 1):
#     if s[i] % mn == 0 or s[i + 1] % mn == 0:
#         k += 1
#         w.append(s[i] + s[i + 1])
# print(k, max(w))

#       Программа выведет:
#       537 19247

