#       Вариант № 19.


#       № 17
#  (№ 6759) (ЕГЭ-2023)
#  Перед выполнением данного задания необходимо скачать файл с оффициального сайта Полякова
# f = open('17-381.txt')
# s = [int(x) for x in f]
# # print(s)  #  Проверка на корректный поток чисел из файла 17.txt
# k = 0
# w = []
# m = []
# for i in range(len(s)):
#     if 999 < abs(s[i]) < 10000:
#         if abs(s[i]) % 100 == 39:
#             m.append(s[i])
# mx = max(m)
# for i in range(len(s) - 1):
#     if (999 < abs(s[i]) < 10000) + (999 < abs(s[i + 1]) < 10000) == 1 and (s[i] + s[i + 1]) ** 2 <= mx ** 2:
#         k += 1
#         w.append(s[i] + s[i + 1])
# print(k, max(w))

#       Программа выведет:
#       1591 9233

