#       Вариант № 6.


#       № 17
#  (№ 7681)
#  Перед выполнением данного задания необходимо скачать файл с оффициального сайта Полякова
# f = open('17-411.txt')
# s = [int(x) for x in f]
# # print(s)   #  Проверка на корректный поток чисел из файла 17.txt
# k = 0
# w = []
# m = []
# for i in range(len(s)):
#     if s[i] % 10 == 7:
#         m.append(s[i])
# mx = max(m)
# for i in range(len(s) - 1):
#     s1 = str(s[i])
#     s2 = str(s[i + 1])
#     if (s1[0] == s2[0]) and ((s[i] % 10 == 7) or (s[i + 1] % 10 == 7)) and (99 < s[i] < 1000 or 99 < s[i + 1] < 1000):
#         if (s[i] + s[i + 1]) < mx:
#             k += 1
#             w.append(s[i] + s[i + 1])
# print(k, max(w))

#       Программа выведет:
#       3 1027

